package ru.aserdyuchenko.start;

import ru.aserdyuchenko.models.*;
/**
* Программа Tracker. Служит для учета заявок.
* Приложение осуществляет следующие действия:
* 1. Добавление новой заявки
* 2. Редактирования заявки
* 3. Удаления заявки
* 4. Отображение списка всех заявок
* 5. Отображения заявок с условием фильтра
* 6. Добавлять к заявки комментарий
* 
* В заявке может быть следующая информация: имя, описание, дата 
* создания и список комментариев.
*/

/**
* 1. Реализовать класс Tracker
* Реализовать класс Tracker. Данный класс используется как 
* хранилище для заявок. В нем должны быть методы: добавление, 
* редактирования, удаления, получения списка всех заявок и списка 
* по фильтру.
*/

/**
* @author Anton Serdyuchenko
* @since 27.09.2016
* @version 1.0
*/

public class StartUI {

	public static void main(String[] args){
	}
}
